[
	{
		"name": "Large Language Models",
		"instances": [
			{
				"period": "23/24 Summer, 24/25 Summer",
				"text": "I am helping to shape our new course on Transformer-based large language models (<a href=\"https://ufal.mff.cuni.cz/courses/npfl140\">NPFL140</a>). After the brief introduction of the Transformer architecture, we focus on various practical aspects of language modeling. We also put emphasis on group assignments and reading research papers. In the past years, I lead several lectures and helped with preparing practical assigments."
			}
		],
		"img": "2024_llms.png"
	},
	{
		"name": "Machine Learning for Greenhorns",
		"instances": [
			{
				"period": "23/24 Winter, 24/25 Winter",
				"text": "I was a TA for Machine Learning for Greenhorns (<a href=\"https://ufal.mff.cuni.cz/courses/npfl129\">NPFL129</a>), a course which is officially called \"Introduction to Machine Learning with Python.\" and covers the basics of machine learning for bachelor students. I was teaching the English lab and helping the students with homework assignments."
			}
		],
		"img": "2023_npfl129.png"
	},
	{
		"name": "Statistical Dialogue Systems",
		"instances": [
			{
				"period": "22/23 Winter",
				"text": "I was a TA for Statistical Dialogue Systems (<a href=\"https://ufal.mff.cuni.cz/courses/npfl099\">NPFL099</a>), helping with grading homework assignments and teaching the lecture on natural language generation for dialogue systems."
			}
		],
		"img": "2022_npfl099.png"
	},
	{
		"name": "Introduction to Linux",
		"instances": [
			{
				"period": "21/22 Summer",
				"text": "I was teaching a lab for Introduction to Linux (<a href=\"https://d3s.mff.cuni.cz/teaching/nswi177/\">NSWI177</a>) in Czech (finally in person!). We used the inverted lecture system – instead of lectures, the students had a \"<i>before-class reading</i>\" which we built upon during the lab."
			}
		],
		"img": "2022_nswi177.png"
	},
	{
		"name": "Introduction to Algorithms + Programming 1",
		"instances": [
			{
				"period": "20/21 Winter",
				"text": "I was teaching a lab for Introduction to Algorithms (<a href=\"https://is.cuni.cz/studium/predmety/index.php?do=predmet&kod=NPRG062\">NPRG062</a>) and Programming 1 (<a href=\"https://is.cuni.cz/studium/predmety/index.php?do=predmet&kod=NPRG030\">NPRG030</a>) in Czech via Zoom. Didn't expect my first class to be virtual, but finding ways to make it work was a nice challenge! The materials for the course can be found <a href=\"https://github.com/kasnerz/nprg030_2020\">here</a>."
			}
		],
		"img": "2020_nprg030.png"
	}
]